Revit 2026 API

# TableCellStyle Class

---

The TableCellStyle class contains the appearance settings for a given table cell, column, or table.

SystemObject Autodesk.Revit.DBTableCellStyle

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TableCellStyle : IDisposable
```
```vb
Public Class TableCellStyle
	Implements IDisposable
```
```cpp
public ref class TableCellStyle : IDisposable
```
```fsharp
type TableCellStyle =
    class
        interface IDisposable
    end
```

The TableCellStyle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TableCellStyle | Constructs a new TableCellStyle with default settings. |
|  | TableCellStyle(TableCellStyle) | Constructs a new copy of the input TableCellStyle object. |

|  | Name | Description |
| --- | --- | --- |
|  | BackgroundColor | The background color of this cell in the grid view. |
|  | BorderBottomLineStyle | The element id (GraphicsStyle element) for the bottom line of the cell border. |
|  | BorderLeftLineStyle | The element id (GraphicsStyle element) for the left line of the cell border. |
|  | BorderRightLineStyle | The element id (GraphicsStyle element) for the right line of the cell border. |
|  | BorderTopLineStyle | The element id (GraphicsStyle element) for the top line of the cell border. |
|  | FontHorizontalAlignment | The horizontal alignment style of text font. |
|  | FontName | The font used for this style |
|  | FontVerticalAlignment | The vertical alignment style of text font. |
|  | IsEnabled | Gets or sets the status whether this cell is enabled. |
|  | IsFontBold | Gets or sets whether the text font is set to bold of this cell. |
|  | IsFontItalic | Gets or sets whether the text font is set to italic of this cell. |
|  | IsFontUnderline | Gets or sets whether the text font is set to Underline of this cell. |
|  | IsInactivePhaseload | Gets or sets whether this is an inactive phase load cell. |
|  | IsOverridden | Indicates if the cell is overridden or not. |
|  | IsReadOnly | Gets or sets whether this cell is read only. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SheetBackgroundColor | The background color of this cell in the sheet view. |
|  | TextColor | The text color of this cell. |
|  | TextOrientation | The orientation of the cell (for vertical/horizontal text) with input in degrees multiplied by 10 |
|  | TextSize | The text size. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TableCellStyle |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCellStyleOverrideOptions | Gets cell style override options of this cell. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ResetOverride | Resets any overrides applied to this cell. |
|  | SetCellStyleOverrideOptions | Sets cell style override options of this cell. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace